# ExternalResourceType Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceType Constructor
ExternalResourceType Class See Also
---
Creates a new ExternalResourceType instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExternalResourceType(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
ExternalResourceType(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..GuidThe identifier for the ExternalResourceType.
# See Also
ExternalResourceType Class
Autodesk.Revit.DB Namespace